{
  "name": "Priscila Mena Rodriguez",
  "title": "Global Talent Acquisition Partner | Currently Hiring 100% Remote Openings for Software Developers",
  "country": "Mississauga, Ontario, Canadá ",
  "resume": "More than 10 years of experience working full recruitment cycle for IT, BPO, manufacturing, mechanical, Technical, marketing, and advertising industries. Experienced Building Recruitment and HR teams from the ground with 4+ years of experience with the development of recruitment branding, marketing, and sourcing strategies. Strong human resources professional with an educational background focused on Industrial and Organizational Psychology.\n…\nver más",
  "urlLinkedin": "linkedin.com/in/priscila-mena-rodriguez-888542102",
  "experiences": [
    {
      "position": "Technical Talent Acquisition Specialist",
      "date": "ago 2021 – actualidad",
      "company": "Toptal Jornada completa",
      "description": "Responsible for developing and tuning a rigorous sourcing strategy designed to identify top candidates across a variety of functions and creating a stable pipeline of high-quality talent.\nManage the pipeline and keep it steady over time while working with the Sourcing Team Lead to grow sourcing operations and build the necessary playbooks and important metrics needed to seamlessly operate a complex process at scale.\nIdentify, reach out, and attract relevant professionals, preparing them for interviews, negotiating salary, and closing candidates to drive the strategic growth of Toptal’s technical talent community by working closely with the matching team and screening team to determine the dynamic sourcing priority.\n…\nver más"
    },
    {
      "position": "IT Talent Acquisition Partner",
      "date": "jul 2021 – actualidad",
      "company": "Freelance Jornada completa",
      "description": "Identify, recruit, screen, and present good candidates for technology positions, collaborating with hiring managers to set realistic technical requirements while building connections and networking via social media and job boards.\nDevelopment and revision of specifications and job descriptions for selected positions.\nIdentifies the most effective methods for recruiting and attracting candidates and assesses their qualifications through review of their resumes, interviews, and other forms of communications. Coordination of tech evaluation for the candidates. Successfully create a large Talent pipeline to introduce the profiles file to the hiring managers, while keeping track of the ATS information.\n…\nver más"
    },
    {
      "position": "Senior Talent Acquisition Specialist",
      "date": "ago 2020 – jul 2021",
      "company": "Hayco Jornada completa",
      "description": "Responsible for the coordination of attraction, recruiting, selecting, job offers, and onboarding activities with the established personnel requisition processes ensuring the most qualified candidates are hired within the required time period while minimizing the cost per hire, complying with local government requirements while leading a designated recruitment crew. Working closely with Staffing Manager to complete the recruitment and staffing process and bring onboard-qualified candidates for the job openings for local and overseas talent. Coordinate and conduct interview and selection of local and overseas candidates. Manage weekly and monthly Tracker and report including a manual ATS. Conducting reference and background checks for candidates of certain key job positions.\n…\nver más"
    },
    {
      "position": "Talent Acquisition Lead",
      "date": "jul 2019 – ago 2020",
      "company": "Ogilvy Jornada completa",
      "description": "Develop long-term recruiting strategies and cultivate relationships with potential hires while locating candidates to fit the company's total compensation and benefits package aligned to the company’s strategy and business goals. Prepare job descriptions, job analyses, job evaluations, and job classifications. Participate in salary and labor market surveys to determine prevailing pay rates and benefits. Conduct ongoing research into emerging trends, issues, and best Recruitment practices. In charge of creating a solid portfolio of the best talents in the country for the current and future hiring needs of all group companies. Lead meetings with the leaders and managers of each department of the different companies in order to identify the needs of new requirements. Determine the criteria of the complete selection cycle, taking charge of the design and management of recruitment and selection processes (selection of curriculum, selection calls, interviews, etc.). Serve as a brand ambassador at various events, such as career fairs or on-campus recruiting events, representing the company internally and externally at events with the goal of networking and building relationships with potential candidate communities.\n…\nver más"
    },
    {
      "position": "Western Digital Professional Adviser",
      "date": "jun 2012 – jun 2013",
      "company": "Stream Global Services Jornada completa",
      "description": "Collaborated with the recruiting department by getting applicants for the company at Job Fairs. Job Duties:-Determines requirements by working with customers. Answers inquiries by clarifying desired information; researching, locating, and providing information. Resolves problems by clarifying issues; researching and exploring answers and alternative solutions; implementing solutions; escalating unresolved problems. Fulfilling requests by clarifying desired information; completing transactions; forwarding requests. Sells additional services by recognizing opportunities to up-sell accounts; explaining new features. Maintains call center database by entering information. Keeps equipment operational by following established procedures, reporting malfunctions. Updates job knowledge by participating in educational opportunities. Enhances organization reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments.\n…\nver más"
    },
    {
      "position": "Adm. Assistant / HR. Recruiter",
      "date": "ene 2009 – dic 2010",
      "company": "Aromesa International Jornada completa",
      "description": "Develop and execute recruiting plans. Lead the creation of a recruiting and interviewing plan for sealing positions efficiently and effectively fill open positions. Develop a pool of qualified candidates in advance of need. Utilize the Internet for recruitment.-Post positions to appropriate Internet sources.\nResearch new ways of using the Internet for recruitment-Use social and professional networking sites to identify and source candidates.\n…\nver más"
    },
    {
      "position": "Recruitment Coordinator",
      "date": "may 2017 – mar 2019",
      "company": "Teleperformance",
      "description": "In charge of developing brand awareness, generating inbound traffic, and encouraging company adoption for external and internal candidates, while managing all recruitment-related provider's services.\nDevelop, coordinates and implements marketing and sourcing strategies to ensure availability of qualified applicants, adhering to budget and resources. Developing international recruitment processes for designated LATAM countries.\nExecute international and Local Job Fairs for expansion possibilities while researching mass events and organizations for recruitment purposes; analyzes and responds to recruitment issues. Develop community public relations and partnerships with various community agencies and educational institutions. Provided a day–to-day management to a designated recruitment team and developed and executed methods of assessing top talent for the organization. Facilitate proactive consultation and support for the integrated Talent Management model in the specialized area of recruitment. Responsible for collaborating with and serving as a resource for Teleperformance Dominican Republic, will work closely with internal clients and HR, promoting open channels of communication and responsiveness to the organization’s strategic recruitment needs.\n…\nver más"
    },
    {
      "position": "Talent Acquisition Specialist",
      "date": "mar 2016 – may 2017",
      "company": "Teleperformance",
      "description": "Responsibilities include sourcing candidates through various channels, planning interview and selection procedures and hosting or participating in career events for the Dominican Republic, Mexico and Guatemala. Being able to develop long-term recruiting strategies and nurture trusting relationships with potential hires. Create strong talent pipelines for our company’s current and future hiring needs. Manage the relationship with candidates from the initial conversation throughout the duration of their application process and onboarding. Responsible for evaluating required jobs related to Customer service, competencies, salary negotiations, interview preparation, schedule match, background check, credit record and psychometric test. Educate/train hiring managers on recruiting processes, use of psychometric assessments, hiring/ interviewing practices and procedures with a focus on behavioral interviewing techniques. Deliver great results with little supervision, and effectively manage multiple candidates. Meets standard measurements of success for staffing, including but not limited to: annual hiring plan, diversity goals, and cost/time to hire standards. Document all recruiting-related activity in ATS.\n…\nver más"
    },
    {
      "position": "Recruitment Specialist",
      "date": "feb 2014 – mar 2016",
      "company": "Teleperformance",
      "description": "The Sourcing and Recruitment Specialists responsible to develop and execute recruiting plans to bring qualified candidates by leading the creation of a recruiting and interviewing plan to fill open positions. Develop a pool of qualified candidates in advance of need. Utilize the Internet for recruitment: Post positions on appropriate Internet sources, research new ways of using the Internet for recruitment, evaluate the candidates attracted by social and professional networking on company sites. Needs to complete screening and evaluations of applicants to ensure they match the requirements for the open positions.-Initialize on-site candidates’ applications process, documenting, feeding, and conducting assessments.-Implement & support Sourcing Department´s initiatives such as Refer-a-Friend program, Flyers delivery, job fair, massive events, etc. Confirmation of appointments for the current day contacting the candidates under the Ready For Assessments Status on recruitment system. Screening of the candidates to Assure they have the level of English necessary to run out evaluating and interviewing processes If qualified. Collect demographics. Check on our Database for possible previous applications or rehire statuses. Creation of Assessment to assign the candidate. Scheduling on the Ital Department Google Calendar. Send Appointment Confirmation EMail. Email profiling tests If NOT qualified, Document the Candidates profile with detailed specifications and refer them to a future reevaluation if applied into ATS. Help support the Refer a Friend initiative within the company (employees and candidates).Assisting selection Specialists with the flow of candidates when needed.\n…\nver más"
    }
  ],
  "educations": [
    {
      "institution": "Atlantic International University",
      "career": "Bachelor's degree",
      "date": "2017 – 2020"
    },
    {
      "institution": "Universidad Autónoma de Santo Domingo",
      "career": "Bachelor’s Degree",
      "date": "2014 – 2017"
    },
    {
      "institution": "Attraversare",
      "career": "Certification",
      "date": "2015 – 2015"
    },
    {
      "institution": "Attraversare",
      "career": "Diplomat",
      "date": "2015 – 2015",
      "description": "#1 Student on the Class"
    }
  ]
}